B2BGITVersion/BookingAPIFiles/ReadBooking.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://www.juniper.es/webservice/2007/">
   <soapenv:Header/>
   <soapenv:Body>
      <ReadBooking>
         <ReadRQ Version="1.1" Language="en">
            <Login Email="user@mydomain.com" Password="pass"/>
            <ReadRequest ReservationLocator="TQ1TBG"/>
         </ReadRQ>
      </ReadBooking>
   </soapenv:Body>
</soapenv:Envelope>